{"reviewerID": "A1E5ZR1Z4OQJG", "asin": "1495329321", "reviewerName": "Pure Jonel \"Pure Jonel\"", "helpful": [0, 0], "reviewText": "Da Silva takes the divine by storm with this unique new novel.  She develops a world unlike any others while keeping it firmly in the real world.  This is a very well written and entertaining novel.  I was quite impressed and intrigued by the way that this solid storyline was developed, bringing the readers right into the world of the story.  I was engaged throughout and definitely enjoyed my time spent reading it.I loved the character development in this novel.  Da Silva creates a cast of high school students who actually act like high school students.  I really appreciated the fact that none of them were thrown into situations far beyond their years, nor did they deal with events as if they had decades of life experience under their belts.  It was very refreshing and added to the realism and impact of the novel.  The friendships between the characters in this novel were also truly touching.Overall, this novel was fantastic.  I can&#8217;t wait to read more and to find out what happens next in the series.  I&#8217;d definitely recommend this debut novel by Da Silva to those who want a little YA fun with a completely unique & shocking storyline.Please note that I received a complimentary copy of this work in exchange for an honest review.", "overall": 4.0, "summary": "An amazing first novel", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"}
{"reviewerID": "A30PZPI6FPH0A7", "asin": "0399157565", "reviewerName": "Jackmollie", "helpful": [0, 0], "reviewText": "For me personally it's the most disappointing book I have ready re: Kay Scarpetta. I generally can't put a Cornwell book down, but I had to force myself to keep reading it. Hard to stay focused when half a book describes approximately 4-6 hours.", "overall": 2.0, "summary": "disappointed", "unixReviewTime": 1400112000, "reviewTime": "05 15, 2014"}
{"reviewerID": "A1GQ2UI5BKCCRD", "asin": "0984528105", "reviewerName": "Gail Hodges", "helpful": [0, 0], "reviewText": "Very simple book, but leaves you feeling good.  No over the top sex scenes, no graphic violence.  Just a simple book that talks touches on child abuse and dysfunction in a family.  I liked it because the author did not go into graphic detail about the abuse, but instead focused how it affected the people involved.  Good story, good characters.", "overall": 4.0, "summary": "Good book", "unixReviewTime": 1401235200, "reviewTime": "05 28, 2014"}
{"reviewerID": "A2DF4LQQI6KSQ2", "asin": "0804139024", "reviewerName": "Olga", "helpful": [0, 0], "reviewText": "I read a library copy of this exceptionally well-written novel, and bought it as a gift for my son-in-law (a theoretical particle physicist) who is hard to buy for.  This is a thriller, with problems and solutions unfolding one after another, and overlapping.  There is science (always explained) and there is humor.  It's been a while since I read a book I enjoyed so much.", "overall": 5.0, "summary": "Science Fiction at its best!", "unixReviewTime": 1396483200, "reviewTime": "04 3, 2014"}
{"reviewerID": "A1UAMAWY966P2", "asin": "0765317583", "reviewerName": "Nadyne M Ichimura", "helpful": [0, 0], "reviewText": "With the government knowing this could happen and not telling anyone then this is a good story of what would happen if an emp attack happened.", "overall": 5.0, "summary": "Excellent story", "unixReviewTime": 1397001600, "reviewTime": "04 9, 2014"}
{"reviewerID": "A37XLAHHT78YAP", "asin": "0606238409", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Love the book, great story line, keeps you entertained.for a first novel from this author she did a great job,  Would definitely recommend!", "overall": 4.0, "summary": "great book!", "unixReviewTime": 1390176000, "reviewTime": "01 20, 2014"}
{"reviewerID": "AUXAGCDGL3RZP", "asin": "B00FJKDYWW", "reviewerName": "merman", "helpful": [1, 1], "reviewText": "A well written fast paced story with twists and surprises around every corner and of course a wonderful love story too.", "overall": 5.0, "summary": "Another Winner!", "unixReviewTime": 1399593600, "reviewTime": "05 9, 2014"}
{"reviewerID": "ATT15IFF1UBAQ", "asin": "0060781939", "reviewerName": "A. Nuhanovic \"AlNuhano\"", "helpful": [0, 0], "reviewText": "It was good....there is a lot going on with multiple characters, I guess setting up for the whole series and introducing the upcoming leading Duchesses.", "overall": 4.0, "summary": "Very fast paced", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A3DIRR3JME6UPQ", "asin": "1495307352", "reviewerName": "Shugabean", "helpful": [0, 0], "reviewText": "I sit here, in tears.  I don't even know what to say.  Never have I ever read anything like this.  How does it end here?  My heart is broken, but it's full.  I don't know that I will ever be able to read this book again, but it know that I will never, ever forget it.  Do I recommend this book? Absolutely.  And no,  I don't.  Nothing is what it seemed and I am sitting here, thinking, what am I supposed to do now.  The ending is perfect.  The ending is horrible and I want something different. I read for entertainment.  To be happy or frightened or whatever emotion.  Right now, there are too many conflicting emotions.  I'm glad I read this book, but I wish I had never picked it up.  I haven't check to see if there is going to be more to the story, because I don't want to hope, then again I don't want to changeWhat happens.  Basically, I am a confused mess.  And I love it.", "overall": 5.0, "summary": "What just happened??", "unixReviewTime": 1389657600, "reviewTime": "01 14, 2014"}
{"reviewerID": "A3I7EO9OU6YAY", "asin": "1492254398", "reviewerName": "whitfield25", "helpful": [1, 1], "reviewText": "Loved it! Could not put it down! The only thing worse than having a deadly stalker, is that no one believes that you have a deadly stalker. Skye Sullivan KNOWS that someone ran her off the road and ended her dancing career. So how does she prove it? Trace, the man Skye has loved since she was 15 years old, is now a prime suspect. Now what? This book has you guessing all the way to the shocking end! Nicely Done!", "overall": 5.0, "summary": "A Real Page Turner!", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"}